subtopics = {
    "theory_grain": ["История возникновения кофе", "Распространение кофе", "Ареал произрастания кофе", "Арабика и робуста",
                  "Вкус", "Теруар", "Обжарщики", "Строение кофейной ягоды", "Методы сбора урожая",
                  "Методы обработки урожая", "Ферментация", "Обжарка"],
    "equipment": ["Кофемашины", "Кофемолки", "Фильтр кофеварки"],
    "specialty_coffee": ["Что такое спешиалти кофе", "Направления обучения", "Ассоциация", "Дескрипторы", "Альтернатива",
                      "Три волны культуры", "Молоко и его влияние"],
    "introduction_espresso": ["История эспрессо", "Что такое эспрессо", "Стандарты", "Время дегустации"],
    "service_book":["Servise Book", "Контакт", "Потребности", "Презентация товара", "Возражения", "Завершение продажи",
                  "Обратная связь"],
    "shelf_life":["Десерты", "Ланчи", "Расходники"]
}

# Словарь для хранения текстовых описаний для каждой подтемы
subtopic_descriptions = {
    "История возникновения кофе": "Согласно легенде, пастух Калди из провинции Каффа на юге Эфиопии (по одной из "
                                  "версий, от названия провинции происходит само слово «кофе») заметил, "
                                  "что после употребления кофейных ягод его козы становились активными и отказывались "
                                  "спать по ночам. Он сам попробовал ягоды и обнаружил их тонизирующий эффект. О "
                                  "своих наблюдениях Калди доложил аббату местного монастыря, но тот осудил пастуха и "
                                  "бросил ягоды в огонь. Помещение наполнилось соблазнительным ароматом жареных "
                                  "кофейных зерен, и аббат решил приготовить из ягод напиток. Выпив его, "
                                  "он ощутил заметный прилив сил, который позволил ему оставаться бодрым во время "
                                  "многочасовой вечерней молитвы. Об открытии аббат рассказал другим монахам "
                                  "монастыря, а те понесли знание дальше.",
    "Распространение кофе": "<br><img src='ссылка_на_изображение_кофе.jpg' alt='История кофе'>" 
                            "Из Эфиопии кофе распространился в Египет и Йемен. Наиболее ранние свидетельства "
                            "употребления кофе относятся к середине XV века в суфийских монастырях Йемена. Из Эфиопии "
                            "кофейный напиток распространился по всему Ближнему и Среднему Востоку. К XIX веку кофе "
                            "широко распространился в Италии, Индонезии и Америке.",
    "Ареал произрастания кофе": "Кофейный пояс Земли – так называют зону от ~ 10° северной и до 10° южной широты, "
                                "где произрастают кофейные деревья. Именно здесь выпадает нужное количество осадков ("
                                "150-300 см. в год). Здесь  наблюдается нужная температура воздуха, которая состоит в "
                                "пределах +15 - +30 ° С и так идеально подходит для успешного роста кофе. Температура "
                                "ниже +12° С является для кофейных деревьев уже критической. В зависимости от сорта "
                                "кофе высота произрастания деревьев варьирует от 200 до 2500 м над уровнем моря. "
                                "Здесь и находятся около пятидесяти стран-производителей кофе. Согласно мировой "
                                "статистики лидерами производства кофе уже много лет является  одни и те же страны – "
                                "Бразилия, Вьетнам, Колумбия, Индонезия и другие.",

    "РАЗНИЦА АРАБИКИ И РОБУСТЫ": "<br><img src='img/arabica.jpeg' alt='История кофе'>",
    "Вкус": "В арабике много липидов и сахаров, которые делают вкус интенсивным и кислотным. В конкретном сорте "
            "арабики из конкретного региона можно почувствовать сладость ягод, кислотность цитрусовых, аромат цветов "
            "и орехов. В робусте больше кофеина и хлорогеновой кислоты и мало липидов и сахаров. Это делает робусту "
            "хорошим энергетиком, но кофеин также придаѐт кофе горечь и тяжѐлый аромат. Вкус робусты — терпкий и "
            "плоский. Добиться от него оттенков, как у арабики просто невозможно Вкус сильно зависит от того, "
            "какой уход получает кофе на ферме. То, что робуста неприхотлива к условиям, не значит, что за ней не "
            "нужно ухаживать. Хорошая робуста, за которой следят и ухаживают, будет лучше арабики, которой не уделяют "
            "внимание. ",
    "Теруар": "Терруар – это французское слово (буквально – «почва», «грязь»), Терруар — это совокупность "
              "климатических факторов и свойств почвы в конкретном регионе. Если простым языком — это климат в "
              "котором выращивается кофе. В это понятие включают три основных факторов, которые стабильно влияют на "
              "свойства зёрен: Почва, Температура, Высота, Осадки, Почва Из земли дерево добывает воду и минеральные "
              "вещества — основу, из которой влистьях под действием солнечного света производят органические "
              "вещества. Те, что предназначены для зёрен, уходят в плоды и формируют их вкус. Соответственно, "
              "если почва не задерживает воду, то в засушливый сезон дерево будет страдать от жажды, "
              "а зёрна — недополучать вещества, способные сделать их вкус богатым.Температура Кофейные деревья не "
              "переносят заморозков, даже кратковременное понижение до -1°С способно убить их. Но и повышение "
              "температуры выше 30 °C губительно, выдерживать такую жару деревья могут в течение всего нескольких "
              "часов. Поэтому идеальные условия — это тепло днём и прохлада ночью. Границы оптимума 15–30 °С.Высота "
              "Этот фактор определяет глубину вкуса, поэтому считается наиболее важным. Высокогорный кофе, "
              "как правило, обладает богатым букетом, включающим ноты фруктов, пряностей, ягод и цветов.Средние "
              "высоты — орехи, ваниль, шоколад, цитрусы.Кофе, выращенный на небольших высотах, имеет мало оттенков "
              "вкуса, среди которых преобладают землистые ноты.Чем выше расположена плантация, тем больше суточный "
              "перепад температур, а почвы на больших высотах не бывают болотистыми или чрезмерно сухими. Это и "
              "создаёт идеальные условия для выращивания кофе",
    "Обжарщики": "Роль и важность обжарщиков в процессе приготовления кофе.",
    "Строение кофейной ягоды": "Описание структуры кофейной ягоды.",
    "Методы сбора урожая": "Различные методы сбора кофейных зерен.",
    "Методы обработки урожая": "Различные методы обработки кофейных зерен.",
    "Ферментация": "Процесс ферментации в производстве кофе.",
    "Обжарка": "Информация о процессе обжарки кофейных зерен.",
    "Кофемашины": "Информация о различных типах кофемашин.",
    "Кофемолки": "Информация о различных типах кофемолок.",
    "Фильтр кофеварки": "Информация о фильтрах для кофеварок.",
    "Что такое спешиалти кофе": "Это информация о том, что такое спешиалти кофе.",
    "Направления обучения": "Информация о различных направлениях обучения в сфере кофе.",
    "Ассоциация": "Информация об ассоциациях кофейной индустрии.",
    "Дескрипторы": "Различные дескрипторы в оценке вкусовых характеристик кофе.",
    "Альтернатива": "Альтернативные способы приготовления кофе.",
    "Три волны культуры": "Обзор трех волн кофейной культуры.",
    "Молоко и его влияние": "Влияние молока на вкус и качество кофе.",
    "История эспрессо": "Это история возникновения эспрессо.",
    "Что такое эспрессо": "Информация о том, что такое эспрессо.",
    "Стандарты": "Стандарты приготовления эспрессо.",
    "Время дегустации": "Время, необходимое для дегустации кофе.",
    "Servise Book": "Информация о Servise Book.",
    "Контакт": "Контактная информация.",
    "Потребности": "Потребности клиентов в кофейной индустрии.",
    "Презентация товара": "Презентация кофейных товаров перед клиентами.",
    "Возражения": "Как реагировать на возражения клиентов.",
    "Завершение продажи": "Завершение процесса продажи.",
    "Обратная связь": "Важность обратной связи от клиентов.",
    "Десерты": "Информация о сроках годности десертов.",
    "Ланчи": "Сроки годности ланчей.",
    "Расходники": "Сроки годности расходных материалов."
}
